#pragma once
#ifndef QR_JU_LD_CPP 
#define QR_JU_LD_CPP

#include  <E:\lib\define.h>
#include  <E:\lib\头文件 c++.h>

using namespace std;


class 初始化
////////////////////////////// 这部分没有用 用不到
{
public:
	//>全局
	string 盘符 = "E"; //string->char 简单; char->string string(1, 初始化.盘符); to_string(c);
	int 字体 = 20, 屏幕总显示范围x1 = 2160 + 1920, 屏幕总显示范围y1 = 3840;
	// int 屏幕2x = 2160, 屏幕2y = 3840;
	// int 屏幕3x = 2160, 屏幕3y = 3840;
	//上下左右
	int 主屏幕x = 0, 主屏幕x1 = 2160;
	int 主屏幕y = 0, 主屏幕y1 = 3840;

	int 屏幕2x = 2160, 屏幕2x1 = 4079,  屏幕2横= 1920;			 int 屏幕2hg = 1920;
	int 屏幕2y = 1551, 屏幕2y1 = 2630, 屏幕2竖 = 1080;			 int 屏幕2uu = 1080;
	
	//文本读取
	//vector<int> 行数[];
	int 光标位置 = 0, 个数 = 0, 换行 = 0;
	size_t 当前内容的字符数量 = 0; //auto const 
	//string 全部每行的内容[];
	//string 每行一行的内容;
	//int 这一行每行的内容的光标位置 = 0;
	fstream 默认文档;	fstream 匹配词暂存;
	//int 结果是1就是有t1, 结果是1就是有t2;

	//行数[0] = 1;

	//按键识别
	int 四位个数 = 1, 四位个数初始化 = 0;
	int 计数[46];
	int 四位个数一帧 = 1, 按下 = 0, 刷新 = 0; //计数1 = 0, 计数2 = 0, 
	int 现在[1400], 之前[1400];

	//class

public:
	auto 读取外部变量()
	{
		fstream 初始化配置;
		vector<string> 读取初始化配置的一个词;

		//从头读写("E:\\PINKIE PIE\\记忆\\", 初始化配置);

		初始化配置 >> 读取初始化配置的一个词[0];
		//如果有内容

		//while(读取初始化配置的一个词[0]) { //!初始化配置.is_open() //[0]
		//	//修改初始量
		//	if (读取初始化配置的一个词 == a) {
		//		a == 读取初始化配置的一个词;
		//	}
		//	vector<int>程序正在做什么;
		//	盘符 = 读取初始化配置的一个词;
		//	goto 程序初始化完;
		//}
	程序初始化完:;
	}
	auto 初始化主体() //string a
	{



	}




};
////////////////////////////////////////////////////////////////////////////////////////////////////////////////



#endif