#pragma once
#ifndef _43色图片_H
#define _43色图片_H

#include  <E:\lib\前置变量.h>
#include  <E:\lib\图片属性.h>
#include  <E:\lib\头文件 c++.h>
#include  <E:\lib\头文件 opcv.h>

////#include  <E:\lib\图片识别`函数.h>

////using namespace wode;
class 图片识别_43色 /*识别函数*/ {
public:
	cmd cmd1;
public:
	/**///定量
	COORD 图片尺寸; COORD 检测的范围 = { 0,0 }; COORD v的尺寸;
	/**///输出
	COORD 输出图片的坐标;
		/*记录*/
	int r, g, b;
	新v3i v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20;
public:
	图片识别_43色() {
		v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20.assign(26, 新v2i(26, 新vi(13, 0)));
		/*下面填入数据啊*/
		/*todo 手动填吧*/
		//v3iRgbTO16色_颜色对照表_行是r列是g纵是bY是rX是gZ是b
		/*第一部分,r=0,g+10,b+20                                0   1   2   3   4   5   6   7   8   9  10  11  12 */
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][0] = { 黑色,深蓝,深蓝,深蓝,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][1] = { 深绿,深蓝,深蓝,深蓝,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][2] = { 深绿,深青,深蓝,深蓝,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][3] = { 深绿,深绿,深蓝,深蓝,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][4] = { 深绿,深绿,深青,深蓝,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][5] = { 深绿,深绿,深蓝,深蓝,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][6] = { 绿色,绿色,绿色,深青,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][7] = { 绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][8] = { 绿色,绿色,绿色,绿色,深青,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][9] = { 绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		/*                                                      0   1   2   3   4   5   6   7   8   9  10  11  12 */
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][10] = { 绿色,绿色,绿色,绿色,绿色,深青,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][11] = { 绿色,绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][12] = { 绿色,绿色,绿色,绿色,绿色,绿色,深青,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][13] = { 绿色,绿色,绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][14] = { 绿色,绿色,绿色,绿色,绿色,绿色,绿色,深青,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][15] = { 绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色, };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][16] = { 绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,深青,蓝色,蓝色,蓝色,蓝色, };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][17] = { 绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色, };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][18] = { 绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,深青,蓝色,蓝色,蓝色, };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][19] = { 绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色, };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][20] = { 绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,深青,蓝色,蓝色, };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][21] = { 绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,蓝色,蓝色, };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][22] = { 绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,深青,蓝色, };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][23] = { 绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,蓝色, };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][24] = { 绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,深青, };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[0][25] = { 绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色,绿色, };
		/*第二部分,r=10,g+10,b+20                               0   1   2   3   4   5   6   7   8   9  10  11  12 */
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][0] = { 深红,深蓝,深蓝,深蓝,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色, };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][1] = { 深紫,深蓝,深蓝,深蓝,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][2] = { 深绿,深青,深蓝,深蓝,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][3] = { 深绿,深绿,深蓝,深蓝,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][4] = { 深绿,深绿,深青,深蓝,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][5] = { 深绿,深绿,深蓝,深蓝,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][6] = { 绿色,绿色,绿色,深青,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][7] = { 绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][8] = { 绿色,绿色,绿色,绿色,深青,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][9] = { 绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色 };
		/*后面都不对*/
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][10] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][11] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][12] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][13] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][14] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][15] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][16] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][17] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][18] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][19] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][20] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][21] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][22] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][23] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][24] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[1][25] = {绿色,绿色,绿色,绿色,绿色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色,蓝色                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[2][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[3][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[4][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[5][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[6][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[7][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[8][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[9][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[10][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[11][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[12][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[13][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[14][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[15][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[16][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[17][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[18][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[19][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[20][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[21][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[22][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[23][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[24][25] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][0] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][1] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][2] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][3] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][4] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][5] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][6] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][7] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][8] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][9] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][10] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][11] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][12] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][13] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][14] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][15] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][16] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][17] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][18] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][19] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][20] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][21] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][22] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][23] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][24] = {                                    };
		///v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[25][25] = {                                    };

	}
	/**///▬输入图片▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬
	/*i-->rgb*/

	/*s-->rgb*/

	/*i-->s*/
	void getITOs43色转换(int 输入, string& 输出) {
		switch (输入) {
		default: break;
		case 0:	 输出 = "黑色  ";	   break;
		case 1:	 输出 = "灰色  ";	   break;
		case 2:	 输出 = "银色  ";	   break;
		case 3:	 输出 = "白色  ";	   break;
		case 4:	 输出 = "深红  ";	   break;
		case 5:	 输出 = "红色  ";	   break;
		case 6:	 输出 = "浅红  ";	   break;
		case 7:	 输出 = "深绿  ";	   break;
		case 8:	 输出 = "绿色  ";	   break;
		case 9:	 输出 = "浅绿  ";	   break;
		case 10:	 输出 = "深蓝  ";  break;
		case 11:	 输出 = "蓝色  ";  break;
		case 12:	 输出 = "浅蓝  ";  break;
		case 13:	 输出 = "深黄  ";  break;
		case 14:	 输出 = "黄色  ";  break;
		case 15:	 输出 = "浅黄  ";  break;
		case 16:	 输出 = "深红黄";  break;
		case 17:	 输出 = "红黄色";  break;
		case 18:	 输出 = "浅红黄";  break;
		case 19:	 输出 = "深绿黄";  break;
		case 20:	 输出 = "绿黄色";  break;
		case 21:	 输出 = "浅绿黄";  break;
		case  22:	 输出 = "深青  ";  break;
		case  23:	 输出 = "青色  ";  break;
		case  24:	 输出 = "浅青  ";  break;
		case  25:	 输出 = "深绿青";  break;
		case  26:	 输出 = "绿青色";  break;
		case  27:	 输出 = "浅绿青";  break;
		case  28:	 输出 = "深蓝青";  break;
		case  29:	 输出 = "蓝青色";  break;
		case  30:	 输出 = "浅蓝青";  break;
		case 31:	 输出 = "深紫  ";  break;
		case 32:	 输出 = "紫色  ";  break;
		case 33:	 输出 = "浅紫  ";  break;
		case  34:	 输出 = "深红紫";  break;
		case  35:	 输出 = "红紫色";  break;
		case  36:	 输出 = "浅红紫";  break;
		case  37:	 输出 = "深蓝紫";  break;
		case  38:	 输出 = "蓝紫色";  break;
		case  39:	 输出 = "浅蓝紫";  break;
		case 40:	 输出 = "深粉  ";  break;
		case 41:	 输出 = "粉红  ";  break;
		case 42:	 输出 = "浅粉  ";  break;
		}/*switch*/
	}
	string retITOs43色转换(int 输入) {
		switch (输入) {
		default: break;
		case 0:	retu "黑色  ";	   break;
		case 1:	retu "灰色  ";	   break;
		case 2:	retu "银色  ";	   break;
		case 3:	retu "白色  ";	   break;
		case 4:	retu "深红  ";	   break;
		case 5:	retu "红色  ";	   break;
		case 6:	retu "浅红  ";	   break;
		case 7:	retu "深绿  ";	   break;
		case 8:	retu "绿色  ";	   break;
		case 9:	retu "浅绿  ";	   break;
		case 10:	retu "深蓝  ";  break;
		case 11:	retu "蓝色  ";  break;
		case 12:	retu "浅蓝  ";  break;
		case 13:	retu "深黄  ";  break;
		case 14:	retu "黄色  ";  break;
		case 15:	retu "浅黄  ";  break;
		case 16:	retu "深红黄";  break;
		case 17:	retu "红黄色";  break;
		case 18:	retu "浅红黄";  break;
		case 19:	retu "深绿黄";  break;
		case 20:	retu "绿黄色";  break;
		case 21:	retu "浅绿黄";  break;
		case  22:	retu "深青  ";  break;
		case  23:	retu "青色  ";  break;
		case  24:	retu "浅青  ";  break;
		case  25:	retu "深绿青";  break;
		case  26:	retu "绿青色";  break;
		case  27:	retu "浅绿青";  break;
		case  28:	retu "深蓝青";  break;
		case  29:	retu "蓝青色";  break;
		case  30:	retu "浅蓝青";  break;
		case 31:	retu "深紫  ";  break;
		case 32:	retu "紫色  ";  break;
		case 33:	retu "浅紫  ";  break;
		case  34:	retu "深红紫";  break;
		case  35:	retu "红紫色";  break;
		case  36:	retu "浅红紫";  break;
		case  37:	retu "深蓝紫";  break;
		case  38:	retu "蓝紫色";  break;
		case  39:	retu "浅蓝紫";  break;
		case 40:	retu "深粉  ";  break;
		case 41:	retu "粉红  ";  break;
		case 42:	retu "浅粉  ";  break;
		}/*switch*/
	}
	/*rgb-->i*/
	int retRgbTO16色_用v比对(int r, int g, int b) { //rgb-->i,颜色转换
			//制作v`for的时候, 行 + 10, 列 + 10, 纵 + 20. 所以r/=10,g,b/=20
			/*我肉眼判断7400次就行了*/
		r /= 10, g /= 10, b /= 20;
		retu v3iRgbTO16色_颜色对照表_行是r列是g纵是b_跨度r10g10b20[r][g][b];
	}
	int retRgbTO16色_排除法(int r, int g, int b) { //rgb-->i,颜色转换
		/*从0开始*/
		if (r < g) {
			if (g > b) {

			}/*if`g*/
			if (g < b) {

			}/*if`g*/
			 /*g=b*/

		}/*if`r*/
		if (r > g) {
			if (g > b) {

			}/*if`g*/
			if (g < b) {

			}/*if`g*/
			 /*g=b*/
		}/*if`r*/
		/*r = g*/
		retu 0;
	}
	int retRgbTO16色_不考虑r的排除法(int r, int g, int b) { //rgb-->i,颜色转换
		int r减g, g减b, r减b, 结果, 结果2, 结果3, 结果4, g乘2, b乘2, r乘2, 暂时r, 暂时g, 暂时b;
		//r减g = r - g;
		//g减b = g - b;
		//r减b = r - b;
		///g乘2 = g * 2, b乘2 = b * 2, r乘2 = r * 2;
		//g乘2 = g * 2;
		//b乘2 = b * 2;
		if (r == 0) {/*如果r不对,里面的不算的*/
			if (g * 2 <= b) {
				retu 蓝色;
			} else {/*2*g>b*/
				retu 蓝青色;
			}/*else*/
			if (g >= b) {
				retu 绿青色;
			}/*if*/
			if (g >= b * 2) {
				retu 绿色;
			}/*if*/
			retu 黑色;
		}/*if`r*/
		if (r <= 10) {
			if (g * 2 + 10 <= b) {
				retu 蓝色;
			} else {/*2*g>b*/
				retu 蓝青色;
			}/*else*/
			if (g + 10 >= b) {
				retu 绿青色;
			}/*if*/
			if (g + 10 >= b * 2) {
				retu 绿色;
			}/*if*/
			retu 黑色;
		}/*if`r*/
		if (r <= 20) {
			if (g * 2 + 20 <= b) {
				retu 蓝色;
			} else {/*2*g>b*/
				retu 蓝青色;
			}/*else*/
			if (g + 20 >= b) {
				retu 绿青色;
			}/*if*/
			if (g + 20 >= b * 2) {
				retu 绿色;
			}/*if*/
			retu 黑色;
		}/*if`r*/
		if (r <= 30) {
			if (g * 2 + 30 <= b) {
				retu 蓝色;
			} else {/*2*g>b*/
				retu 蓝青色;
			}/*else*/
			if (g + 30 >= b) {
				retu 绿青色;
			}/*if*/
			if (g + 30 >= b * 2) {
				retu 绿色;
			}/*if*/
			retu 黑色;
		}/*if`r*/
		if (r <= 40) {
			if (g * 2 + 40 <= b) {
				retu 蓝色;
			} else {/*2*g>b*/
				retu 蓝青色;
			}/*else*/
			if (g + 40 >= b) {
				retu 绿青色;
			}/*if*/
			if (g + 40 >= b * 2) {
				retu 绿色;
			}/*if*/
			retu 黑色;
		}/*if`r*/
		retu 黑色;
	}
	/*输入前,r除以10g除以10b除以20*/
	int retRgbTO16色_不考虑r的排除法_跨度r10g10b20(int r, int g, int b) { //rgb-->i,颜色转换
		/*todo 以后再说*/
		if (r == 0) {/*如果r不对,里面的不算的*/
			if (g * 2 <= b) {
				retu 蓝色;
			} else {/*2*g>b*/
				if (g <= b) {
				retu 蓝青色;
				}/*if*/
			}/*else*/
			if (g >= b) {
				if (g <= b * 2) {
					retu 绿青色;
				}/*if*/
			}/*if*/
			if (g >= b * 2) {
				retu 绿色;
			}/*if*/
			retu 黑色;
		}/*if`r*/
		if (r <= 1) {
			if (g * 2 + 1 <= b) {
				retu 蓝色;
			} else {/*2*g+1>b*/
				if (g+1 <= b) {
					retu 蓝青色;
				}/*if*/
			}/*else*/
			if (g + 1 >= b * 2) {
				retu 绿色;
			}/*if*/
			if (g + 1 >= b) {
				retu 绿青色;
			}/*if*/
			retu 黑色;
		}/*if`r*/
		if (r <= 2) {
			if (g * 2 + 2 <= b) {
				retu 蓝色;
			} else {/*2*g>b*/
				retu 蓝青色;
			}/*else*/
			if (g + 2 >= b) {
				retu 绿青色;
			}/*if*/
			if (g + 2 >= b * 2) {
				retu 绿色;
			}/*if*/
			retu 黑色;
		}/*if`r*/
		if (r <= 3) {
			if (g * 2 + 3 <= b) {
				retu 蓝色;
			} else {/*2*g>b*/
				retu 蓝青色;
			}/*else*/
			if (g + 3 >= b) {
				retu 绿青色;
			}/*if*/
			if (g + 3 >= b * 2) {
				retu 绿色;
			}/*if*/
			retu 黑色;
		}/*if`r*/
		if (r <= 4) {
			if (g * 2 + 4 <= b) {
				retu 蓝色;
			} else {/*2*g>b*/
				retu 蓝青色;
			}/*else*/
			if (g + 4 >= b) {
				retu 绿青色;
			}/*if*/
			if (g + 4 >= b * 2) {
				retu 绿色;
			}/*if*/
			retu 黑色;
		}/*if`r*/
		retu 黑色;
	}
	int retRgbTO16色_比例(int r, int g, int b) { //rgb-->i,颜色转换
		int 颜色 = -1, r减g, g减b, r减b;
		r减g = r - g;
		g减b = g - b;
		r减b = r - b;
		//if ((r > g) & (r减g <= -110)) {
		if (r < g) {
			if (r减g <= -110) {
				if ((g减b <= 60) || (g减b >= -60)) {/*越绿越亮,蓝暗一点*/
					retu 青色;/*R小,GB大`一样*/
				}
			}/*if (r减g <= -110)*/
		}/*if r<g*/
		if (r > g) {
			if (r减g <= 50) {/*r比g大<=50*/
				if (g减b <= -90) {/*g比b小>=90*/
					retu 紫色;/*红d绿x蓝d*/
				}/*if g减b*/
				 /*不对*/
				retu 青色;/*R小,GB大`;g比b小<=90*/
				if (r减g <= 50) {
					retu 紫色;
				}/*if r减g*/
				 /*这里r>g`>=50*/
				 /*r减g越小,g减b也越小; g减b>=40+r减g -->*/
				if (g减b - r减g >= 40) {/*todo 不擅长这种复杂的,写成两步吧*/
					retu 黄色;/*红大绿大蓝小*/
				}/*if (g减b-r减g>= 40)*/
				if (r减g <= 60) {/*r比g大<=50*/
					if (g减b >= 100) {
						retu 黄色;/*红大绿大蓝小*/
					}/*if (g减b >= 100)*/
				}/*if (r减g <= 60)*/
				if (r减g <= 140) {/*r比g大<=140*/
					if (g减b <= -40) {/*g比b小>=40*/
						retu 粉红;/*红d绿x蓝d*/
					}/*if*/
					if (g减b <= -40) {/*g比b小>=40*/
					}/*if*/
					if (g减b >= 100) {
						retu 红黄色;/*红大绿大蓝小*/
					}/*if (g减b >= 100)*/
					if (g减b <= 100) {

					}/*if g减b*/
				}/*if*/
			}/*if r>g*/  /*todo 空格和括号,显示状态,太烦了`几种都要做*/
		}
		retu 0;
	}
	int retRgbTO16色_小于(int r, int g, int b) { //rgb-->i,颜色转换
		int 颜色 = -1, r减g, g减b, r减b, 结果, 结果2, 结果3, 结果4, g乘2, b乘2, r乘2, 暂时r, 暂时g, 暂时b;
		//r减g = r - g;
		//g减b = g - b;
		//r减b = r - b;
		///g乘2 = g * 2, b乘2 = b * 2, r乘2 = r * 2;
		//g乘2 = g * 2;
		//b乘2 = b * 2;
		 /*!没什么了,要删掉*/
		if (r <= 10) {
			if ((b + 2 * g) <= 40) {
			}/*if`gb*/
			if (g <= 10) {
				if ((b + 2 * g) <= 40) {
				}
			}
		}/*if`r*/
		if (r <= 10) {
			if (g <= 10) {
				if (b <= 20) {
					retu 黑色;
				}/*if`b*/
				if (b <= 260) {
					retu 蓝色;
				}/*if`b*/
			}/*if`g*/
			if (g <= 30) {
				if (b >= 30) {
					retu 蓝色;
				}
			}
			if (g <= 120) {
				retu 蓝色;
			}/*if`b*/
			if (g <= 260) {
				if (b <= 20) {
					retu 绿色;
				}/*if`b*/
			}/*if`g*/
		}/*if`r*/
		if (r <= 70) {
			if (g <= 20) {
				if (b <= 210) {
					retu 蓝色;
				}/*if`b*/
				retu 紫色;
			}/*if`g*/
		}/*if`r*/
		if (r <= 80) {
			if (g <= 20) {
				if (b <= 200) {
					retu 蓝色;
				}/*if`b*/
				retu 紫色;
			}/*if`g*/
		}/*if`r*/
		if (r <= 180) {
			if (g <= 20) {
				if (b <= 210) {
					retu /*品红*/紫色;
				}/*if`b*/
				retu 紫色;
			}/*if`g*/
		}/*if`r*/

		retu 颜色;
	}

};
#endif
